---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DivisionPattern
source: html/741f1afe-a8f3-f9da-0364-9bf9dd5c4ad9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DivisionPattern Property

"Division Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId DivisionPattern { get; }
```